HANGMAN = (
    """
     ------
     |    |
     |
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |    |
     | 
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|
     |   
     |   
     |   
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   
     |   
     |     
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   /
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   / \\
     |   
     |   
    ----------
    """
)
d = {
    'Посуда' : ['тарелка', "ложка", "вилка", "нож", "сковородка","дуршлаг", "кастрюля","кружка","сито","половник"],
    'Фрукты' : ["яблоко", "груша", "банан","абрикос", "персик", "лимон","апельсин","мандарин","помело","киви", "гранат"],
    'Овощи' : ["саша","огурец","помидор","картошка", "лук", "морковь","дотеры", "свекла", "чеснок","баклажан","кабачок","перец"],
    'Игры' : ["прятки", "догонялки", "пятнашки","майнкрафт", "валорант","роблокс","бравлик","овервотч","фортнайт","геншин","хонкай"],
    'Сериалы' : ["гадалка","слепая","мухтар","аркейн","эйфория","молодежка","кухня","сашатаня","универ","интерны","пацаны"],
    "Фильмы" : ["брат","оно","драйв","форсаж","интерстеллар","звонок","крик","субстанция", "титаник","хатико","головоломка","шрек"],
    "Животные" : ["слон","медведь","капибара","лошадь","кот","собака","хомяк","крыса","волк","лиса","заяц","олень","лама","носорог","жираф"],
    "Растения" : ["щовель", "одуванчик","ландыш","лаванда","дуб","осина","береза","клен","клевер","роза","тюльпан","ольха","тополь"],
    "Мебель" : ["диван","стул","стол","шкаф","тумба","комод","кровать","полка","кресло","стеллаж","табурет", "дверь"],
    "Города" : ["пермь","москва","губаха","киров","владивосток","кудымкар","уфа","тюмень","новосибирск","екатеринбург","омск","воронеж","торжок"]
}
